InformationRegisters/ВариантыОбеспеченияТТПерсоналомАутсорсинг.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>ВариантыОбеспеченияТТПерсоналомАутсорсинг</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВариантОбеспеченияПерсоналом</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВариантыОбеспеченияПерсоналомАутсорсинг</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ТорговаяТочка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ИсторияИзмененийПотребностиВПерсоналеАутсорсинг.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>ИсторияИзмененийПотребностиВПерсоналеАутсорсинг</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>КоличествоЧеловек</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачалоСмены</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОкончаниеСмены</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отмена</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтправленоWeb</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТорговаяТочка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Должность</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДолжностиВнештатныхСотрудников</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Catalogs/ВариантыОбеспеченияПерсоналомАутсорсинг.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Catalog>
		<Properties>
			<Name>ВариантыОбеспеченияПерсоналомАутсорсинг</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<Name>ОбеспечениеПерсоналом</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Должность</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ДолжностиВнештатныхСотрудников</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоЧеловек</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НачалоСмены</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Time</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОкончаниеСмены</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Time</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

InformationRegisters/ВариантыОбеспеченияТТПерсоналомАутсорсинг/Forms/ФормаЗаписи/Ext/Form/Module.bsl
&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ВариантОбеспеченияПерсоналом", ТекущийОбъект.ВариантОбеспеченияПерсоналом);
	Запрос.УстановитьПараметр("ДатаНачала"					, ТекущийОбъект.ДатаНачала);
	Запрос.УстановитьПараметр("ТорговаяТочка"				, ТекущийОбъект.ТорговаяТочка);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТЧОбеспечениеПерсоналом.Контрагент КАК Контрагент,
	|	&ТорговаяТочка КАК ТорговаяТочка,
	|	&ДатаНачала КАК ДатаНачала,
	|	ТЧОбеспечениеПерсоналом.Должность,
	|	ТЧОбеспечениеПерсоналом.КоличествоЧеловек,
	|	ТЧОбеспечениеПерсоналом.НачалоСмены,
	|	ТЧОбеспечениеПерсоналом.ОкончаниеСмены
	|ИЗ
	|	Справочник.ВариантыОбеспеченияПерсоналомАутсорсинг.ОбеспечениеПерсоналом КАК ТЧОбеспечениеПерсоналом
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИсторияИзмененийПотребностиВПерсоналеАутсорсинг.СрезПоследних(
	|				,
	|				ТорговаяТочка = &ТорговаяТочка
	|					И ДатаНачала = &ДатаНачала) КАК РегистрИстория
	|		ПО (РегистрИстория.Контрагент = ТЧОбеспечениеПерсоналом.Контрагент)
	|			И (РегистрИстория.Должность = ТЧОбеспечениеПерсоналом.Должность)
	|			И (НЕ РегистрИстория.Отмена)
	|ГДЕ
	|	ТЧОбеспечениеПерсоналом.Ссылка = &ВариантОбеспеченияПерсоналом
	|	И РегистрИстория.Контрагент ЕСТЬ NULL ";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	//
	Если НЕ РезультатЗапроса.Пустой() Тогда
		
		НаборЗаписей = РегистрыСведений.ИсторияИзмененийПотребностиВПерсоналеАутсорсинг.СоздатьНаборЗаписей();
		
		Выборка = РезультатЗапроса.Выбрать();
		Пока Выборка.Следующий() Цикл
			ТекЗапись = НаборЗаписей.Добавить();
			ЗаполнитьЗначенияСвойств(ТекЗапись, Выборка);
			ТекЗапись.Период = ТекущаяДата();
		КонецЦикла;
		
		Попытка
			НаборЗаписей.Записать(Ложь);
		Исключение
			Сообщить("Не удалось записать историю изменений варианта");
		КонецПопытки;
		
	КонецЕсли;

КонецПроцедуры
